{
  "grammars": {
    "tree-sitter-awk": {
      "files": [
        "src/parser.c",
        "src/scanner.c"
      ],
      "rev": "refs/heads/master",
      "sha256": "sha256-MDfAtG6ZC0KttJ5bdW71Jgts+SAJitRnwu8xQ26N9K0=",
      "src": "https://github.com/Beaglefoot/tree-sitter-awk"
    },
    "tree-sitter-brainfuck": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/master",
      "sha256": "sha256-auuU2ygyS2cMBQGl1WxfsUcTahI5+rM4fgS1ccjSNtY=",
      "src": "https://github.com/reo101/tree-sitter-brainfuck"
    },
    "tree-sitter-comment": {
      "files": [
        "src/parser.c",
        "src/scanner.c"
      ],
      "sha256": "sha256-JVZkRj7fv/T234ZAk/pM6UYC91mTJoeIgDFkZ9p3m0o=",
      "src": "https://github.com/OXY2DEV/tree-sitter-comment"
    },
    "tree-sitter-crisp": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/master",
      "sha256": "sha256-6yrzLKV+rwHnxoivBnzRn7kJCzyx9qpM5VfBhET3mhM=",
      "src": "https://github.com/reo101/tree-sitter-crisp"
    },
    "tree-sitter-fennel": {
      "files": [
        "src/parser.c",
        "src/scanner.c"
      ],
      "rev": "refs/heads/feat/discard",
      "sha256": "sha256-AKNwDm3+zGkP34CK5JXSHhggff70XMpYVSUyTr2jBFk=",
      "src": "https://github.com/reo101/tree-sitter-fennel"
    },
    "tree-sitter-http": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/main",
      "sha256": "sha256-T/O4oxPEIg3nLi3CxCwGW+iXC18fWW2xgsY5nrptk/M=",
      "src": "https://github.com/NTBBloodbath/tree-sitter-http"
    },
    "tree-sitter-hy": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/main",
      "sha256": "sha256-AtB/tEPmJraVTGxdkFMC3pO1+MwPyutnFkjIMyL7KSw=",
      "src": "https://github.com/kwshi/tree-sitter-hy"
    },
    "tree-sitter-jj_template": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/master",
      "sha256": "sha256-Z4z5u4i6xyLdn+hfmrKlWHISBUnRqcRHkMN+O/QEIK8=",
      "src": "https://github.com/reo101/tree-sitter-jj_template"
    },
    "tree-sitter-move": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/update-parser",
      "sha256": "sha256-L6jxk6Wf8ciSOaUFO7zlQ3zWgZiuoqv44RGbV1QJEPE=",
      "src": "https://github.com/reo101/tree-sitter-move"
    },
    "tree-sitter-noir": {
      "files": [
        "src/parser.c",
        "src/scanner.c"
      ],
      "rev": "refs/heads/main",
      "sha256": "sha256-BQfEQm1D+rKABdMBHVpuGAJvQj7w8zBLgjp/1OHVn0o=",
      "src": "https://github.com/hhamud/tree-sitter-noir"
    },
    "tree-sitter-norg_meta": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/main",
      "sha256": "sha256-8qSdwHlfnjFuQF4zNdLtU2/tzDRhDZbo9K54Xxgn5+8=",
      "src": "https://github.com/nvim-neorg/tree-sitter-norg-meta"
    },
    "tree-sitter-norg_table": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/main",
      "sha256": "sha256-r668hZtAMs5+wG/bfzuskBcXXuOdMtSw4siamlGq4yw=",
      "src": "https://github.com/nvim-neorg/tree-sitter-norg-table"
    },
    "tree-sitter-nu": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/main",
      "sha256": "sha256-0ebKHKexu1TROwfxokwwpPhCO+Nn7HmmX40jRu19xNo=",
      "src": "https://github.com/nushell/tree-sitter-nu"
    },
    "tree-sitter-uci": {
      "rev": "refs/heads/master",
      "sha256": "sha256-SxMwFChWxus/SdWXT7NPwPNqPPB60p6pYGNRyq0t/Y4=",
      "src": "https://github.com/reo101/tree-sitter-uci"
    },
    "tree-sitter-xml": {
      "files": [
        "src/parser.c"
      ],
      "rev": "refs/heads/main",
      "sha256": "sha256-ZEVBC09DmiOUHwaOKgelhCw3Fbj8l6zDs0eo2mGld88=",
      "src": "https://github.com/dorgnarg/tree-sitter-xml"
    }
  },
  "plugins": {
    "BQN": {
      "sha256": "sha256-2S675ru67bcSSXGLEWfPkyW+U+cHzKs/HbM8ZSWMcEs=",
      "src": "https://github.com/mlochbaum/BQN"
    },
    "LuaSnip": {
      "sha256": "sha256-3beTsZPT2EwzAVhEzqNhFRnDAU7C7GlzFFymY3aNp9M=",
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "amp.nvim": {
      "sha256": "sha256-f/li32jpVigbZANnnbgSArnOH4nusj0DUz7952K+Znw=",
      "src": "https://github.com/sourcegraph/amp.nvim"
    },
    "applescript.vim": {
      "sha256": "sha256-0QFLJCJcyTTU0/KVXj2dLGtwW/IhNeWF3NCeatC1M2w=",
      "src": "https://github.com/vim-scripts/applescript.vim"
    },
    "baleia.nvim": {
      "sha256": "sha256-LT2mJWR5gzE65OfF09LRRoycAzkcGqRTcMdN+9jciKs=",
      "src": "https://github.com/m00qek/baleia.nvim",
      "version": "'v1.4.0'"
    },
    "blink-cmp-avante": {
      "sha256": "sha256-tozXOgP0dzIFd3a6mjGehUdytqerkWdfOo89CEVC/Rk=",
      "src": "https://github.com/Kaiser-Yang/blink-cmp-avante"
    },
    "blink.cmp": {
      "sha256": "sha256-d+AT2k4JSr7a5HJNSHRsUo0V0sGIoni6f35mfGJh4Bs=",
      "src": "https://github.com/saghen/blink.cmp",
      "version": "'v1.6.0'"
    },
    "blink.compat": {
      "sha256": "sha256-EMQC+2hjgAGYcBoSKkR5LV7jUsl3Oi8rL3K7FNIHXIw=",
      "src": "https://github.com/saghen/blink.compat",
      "version": "'v2.5.0'"
    },
    "bnf.vim": {
      "sha256": "sha256-cRy4Yib2sATmq7X8jojKIviPrdq9cbYBBRjriCrMuSo=",
      "src": "https://github.com/vim-scripts/bnf.vim"
    },
    "bufdelete.nvim": {
      "sha256": "sha256-ljUNfmpImtxFCS19HC9kFlaLlqaPDltKtnx1+/6Y33U=",
      "src": "https://github.com/famiu/bufdelete.nvim"
    },
    "cmp-calc": {
      "sha256": "sha256-TI1FR0EjzPcjsFdJQ9vXVleQwyXkmqs4TvYyZ8A6cS0=",
      "src": "https://github.com/hrsh7th/cmp-calc"
    },
    "cmp-digraphs": {
      "sha256": "sha256-b4IFjTYvqodJokCGWyNJKShebSzz1UZ91vA5SthxORg=",
      "src": "https://github.com/dmitmel/cmp-digraphs"
    },
    "cmp-latex-symbols": {
      "sha256": "sha256-cRaVtF9uj/33UstjFH/6V6zLzy6JOSqTm+7va4uNAPg=",
      "src": "https://github.com/kdheepak/cmp-latex-symbols"
    },
    "cmp-tmux": {
      "sha256": "sha256-xHnBKOOg/6n06vK7sC3shDw80ci/cl/5xgs7kobd6+s=",
      "src": "https://github.com/andersevenrud/cmp-tmux"
    },
    "colorful-menu.nvim": {
      "sha256": "sha256-hra7QFKWsIqtAWYNDqPv3tJUAsZfVmGTY3AQjeWvxaM=",
      "src": "https://github.com/xzbdmw/colorful-menu.nvim"
    },
    "conjure": {
      "sha256": "sha256-zok8g2jw0bb59DOUhbHKxK0vyqB7Uyspvtt/vqrCZyc=",
      "src": "https://github.com/Olical/conjure"
    },
    "cornelis": {
      "sha256": "sha256-Z/2hBW/bRb8wtJqBUT8tqgoXg4XqGNvp8L6xw+zHDaU=",
      "src": "https://github.com/isovector/cornelis"
    },
    "crates.nvim": {
      "sha256": "sha256-jfmST/S9ymwgQ99PTCOlJkk5zaxE5HiDV16TmTISDII=",
      "src": "https://github.com/saecki/crates.nvim",
      "version": "'stable'"
    },
    "dial.nvim": {
      "sha256": "sha256-J2HU746yz8iHos7od5kIdEUd4/bgAPGwC38fLZ4gK+E=",
      "src": "https://github.com/monaqa/dial.nvim"
    },
    "diffview.nvim": {
      "sha256": "sha256-SX+ybIzL/w6uyCy4iZKnWnzTFwqB1oXSgyYVAdpdKi8=",
      "src": "https://github.com/sindrets/diffview.nvim"
    },
    "dressing.nvim": {
      "sha256": "sha256-dBz+/gZA6O6fJy/GSgM6ZHGAR3MTGt/W1olzzTYRlgM=",
      "src": "https://github.com/stevearc/dressing.nvim"
    },
    "ecolog.nvim": {
      "sha256": "sha256-xUVSkygICCpA3bBqitPblRn7wRQ6fffxJQ4ej5C1ICM=",
      "src": "https://github.com/philosofonusus/ecolog.nvim"
    },
    "endpoint.nvim": {
      "sha256": "sha256-UO5NQ59hdrvZZBO/QDHNGdNzAuA7z/baLpD8xZVhTjg=",
      "src": "https://github.com/zerochae/endpoint.nvim",
      "version": "'v2.6.0'"
    },
    "eyeliner.nvim": {
      "sha256": "sha256-qOMToZtBd39mdFZEr5WfIkHj+7TWeCPy2GJdIN+qOic=",
      "src": "https://github.com/jinh0/eyeliner.nvim"
    },
    "fff.nvim": {
      "sha256": "sha256-WhfHVbNzeNpowoLXg33R9dieATWVObG5oHuGfiAmtvE=",
      "src": "https://github.com/dmtrKovalenko/fff.nvim"
    },
    "fidget.nvim": {
      "sha256": "sha256-Zap4UVicIvCaPqCMgdlnEAGbMzq1xM4uGpVqZL1iju0=",
      "src": "https://github.com/j-hui/fidget.nvim",
      "version": "'v1.1.0'"
    },
    "flatten.nvim": {
      "sha256": "sha256-NaOgzTVqOpQnEIOIMlHCupZUDYnLUic9zITKFxcOg3A=",
      "src": "https://github.com/willothy/flatten.nvim"
    },
    "flex-bison-syntax": {
      "sha256": "sha256-96NXLKiwXSGSz1+UMv+neBcbYHNal3u2ekHHmoFgQqY=",
      "src": "https://github.com/calincru/flex-bison-syntax"
    },
    "follow-md-links.nvim": {
      "sha256": "sha256-qngq7nvxi+Ijxa4sGBRE9m/tqPXSsmznVcTG99I0Yjo=",
      "src": "https://github.com/jghauser/follow-md-links.nvim"
    },
    "friendly-snippets": {
      "sha256": "sha256-FzApcTbWfFkBD9WsYMhaCyn6ky8UmpUC2io/co/eByM=",
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "fyler.nvim": {
      "sha256": "sha256-dqwpIInHwOawX6svUL365wmZBy35oYCCYuGfhivGVeU=",
      "src": "https://github.com/A7Lavinraj/fyler.nvim",
      "version": "'v2.0.0'"
    },
    "git-conflict.nvim": {
      "sha256": "sha256-CmSgmpg5K3ySXYrDjg8yTAojeLWJdSHP8uNVFyrkNhc=",
      "src": "https://github.com/akinsho/git-conflict.nvim"
    },
    "gitlinker.nvim": {
      "sha256": "sha256-zrHvJSROjrDC5XtepOwuDrzrJG2jpnF5NJ05Iwd6DwA=",
      "src": "https://github.com/ruifm/gitlinker.nvim"
    },
    "gitsigns.nvim": {
      "sha256": "sha256-OSSoVBy4X/+V5Bimg7nFormMUugxH/iEoiA6RJFWRnI=",
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'v2.0.0'"
    },
    "graph_view_yaml_parser": {
      "sha256": "sha256-nZyAHAoulTLwq4IVLlWd0kZ9je+9Upe7jY3apAt3anw=",
      "src": "https://github.com/Owen-Dechow/graph_view_yaml_parser"
    },
    "harpoon": {
      "sha256": "sha256-ksPNAYnaFbq7N5ifF+RFbLexLW2Lm1ey0agHLzhn9GA=",
      "src": "https://github.com/ThePrimeagen/harpoon",
      "version": "'harpoon2'"
    },
    "haskell-tools.nvim": {
      "sha256": "sha256-DynWcI3ci99EPi88scqfys4L7/3SNFHGpYQll8Fj0GQ=",
      "src": "https://github.com/MrcJkb/haskell-tools.nvim",
      "version": "'v6.2.0'"
    },
    "headlines.nvim": {
      "sha256": "sha256-LWYYVnLZgw6DhO/n0rclQVnon5TvyQVUGb2smaBzcPg=",
      "src": "https://github.com/lukas-reineke/headlines.nvim",
      "version": "'v4.0.0'"
    },
    "heirline-components.nvim": {
      "sha256": "sha256-M86mP8Xr7tIFi9mM8icHWIzbWTR3W2xdSgzXhxNLMj4=",
      "src": "https://github.com/Zeioth/heirline-components.nvim"
    },
    "heirline.nvim": {
      "sha256": "sha256-kHoaeULWI+NrLp0am0DSKRKeA1vZIg4pt5NxZuFUDvY=",
      "src": "https://github.com/rebelot/heirline.nvim"
    },
    "hlargs.nvim": {
      "sha256": "sha256-WjmVefR0qk2ANWgyHSuYMTuCfzlVTF7tqzAL+uatKkc=",
      "src": "https://github.com/m-demare/hlargs.nvim"
    },
    "hunk.nvim": {
      "sha256": "sha256-GvqD9IggdhZUCzm1BF2yz215AYpJujfOtrJPye4M1O0=",
      "src": "https://github.com/julienvincent/hunk.nvim"
    },
    "hydra.nvim": {
      "sha256": "sha256-GwsitCPMLkTJrjdIyrfzt8wqgHY/aJLNiHzdUBIOrY0=",
      "src": "https://github.com/nvimtools/hydra.nvim",
      "version": "'v1.0.3'"
    },
    "idris2-nvim": {
      "sha256": "sha256-zDb6ke7vzAUWoZPqOgFgszdKe78SI08WRQyPzKTqkXo=",
      "src": "https://github.com/ShinKage/idris2-nvim"
    },
    "indent-blankline.nvim": {
      "sha256": "sha256-0q/V+b4UrDRnaC/eRWOi9HU9a61vQSAM9/C8ZQyKt+Y=",
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim",
      "version": "'v3.9.0'"
    },
    "ionide-vim": {
      "sha256": "sha256-pXeLjC+7VKKIOJIsIUu3HwpgJSyXayDAQX/eIaVmMAo=",
      "src": "https://github.com/ionide/ionide-vim"
    },
    "jj-diffconflicts": {
      "sha256": "sha256-nzjRWHrE2jIcaDoPbixzpvflrtLhPZrihOEQWwqqU0s=",
      "src": "https://github.com/rafikdraoui/jj-diffconflicts"
    },
    "jujutsu.nvim": {
      "sha256": "sha256-30pLorXlZC+R+GCZmWFRTX93wVm8skZuHZGhbpLo5QE=",
      "src": "https://github.com/yannvanhalewyn/jujutsu.nvim"
    },
    "kmonad-vim": {
      "sha256": "sha256-7PKVOsb3jvuGEnP/LsrDr96wFSQMou2dgnV+hRaI444=",
      "src": "https://github.com/kmonad/kmonad-vim"
    },
    "lean.nvim": {
      "sha256": "sha256-ylmhhOJLExIGrSxFsJ42tb4wJUkEThGgvjn4C+v89rU=",
      "src": "https://github.com/Julian/lean.nvim"
    },
    "lua-async-await": {
      "sha256": "sha256-SB+gmBfF3AKZyktOmPaR9CRyTyCYz2jlrxi+jgBI/Eo=",
      "src": "https://github.com/nvim-java/lua-async-await"
    },
    "luarocks.nvim": {
      "sha256": "sha256-siqpyQLpxWYfZKxoPrflnCg8V5oTQcIXKrezjCgZfMM=",
      "src": "https://github.com/vhyrro/luarocks.nvim"
    },
    "luv-vimdocs": {
      "sha256": "sha256-VS3sXj92EBUHr+AHzGBz1WE9xOjYvnQ/r1eGzaKEObQ=",
      "src": "https://github.com/nanotee/luv-vimdocs"
    },
    "lze": {
      "sha256": "sha256-6pYCieJb1F+6znzWwhb8KCm/BAsCbMVzf94fUh4ZU3k=",
      "src": "https://github.com/BirdeeHub/lze"
    },
    "markview.nvim": {
      "sha256": "sha256-zk7krm9CK0DW+hc4gDDdiqUB9gQnOwC64sr3vyy+9kM=",
      "src": "https://github.com/OXY2DEV/markview.nvim",
      "version": "'25'"
    },
    "mind.nvim": {
      "sha256": "sha256-b4atXqR3nO0y3J8RLz4oGCoIssKUfWdZh3rdCfxRi9Y=",
      "src": "https://github.com/Selyss/mind.nvim",
      "version": "'v2.2'"
    },
    "mini.icons": {
      "sha256": "sha256-Tmf/KjoWM8MZmbwNYSPb87grdgtqNN8q3uz3hO9AyE4=",
      "src": "https://github.com/nvim-mini/mini.icons"
    },
    "nabla.nvim": {
      "sha256": "sha256-Q+ZKbL1gqJ9mq3oFuay+Omei/r2OekeH3AmYAU+2VPQ=",
      "src": "https://github.com/jbyuki/nabla.nvim"
    },
    "neo-tree.nvim": {
      "sha256": "sha256-ddhCV0MTbaqfjHFKa2IIsShF6ztCMxtK6+yEa2OAk+k=",
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim",
      "version": "'3.17'"
    },
    "neogit": {
      "sha256": "sha256-+SAYkZqTpLv90D8jutkEFPVLqrJK9sNHsCqnVT37N6A=",
      "src": "https://github.com/TimUntersberger/neogit"
    },
    "neorg": {
      "sha256": "sha256-ukxw43NfHGTFwi2XV4JGIR14gDMCBDNI/LKZfLITjh4=",
      "src": "https://github.com/nvim-neorg/neorg",
      "version": "'v9.1.1'"
    },
    "neorg-telescope": {
      "sha256": "sha256-tvbskEQ3+uOUlGKdqAFMlbF5Vw0A08XTwuWEs2aP64o=",
      "src": "https://github.com/nvim-neorg/neorg-telescope"
    },
    "neotest": {
      "sha256": "sha256-0C4CWTHXXsC/dbZvW5KT+oNXX07rweh2Nem385hwLmI=",
      "src": "https://github.com/nvim-neotest/neotest",
      "version": "'v5.13.4'"
    },
    "neotest-busted": {
      "sha256": "sha256-M2wsET4FBs5CvEp22Mzb/lJ9/xZ4XFmnqGLy0dqGu4k=",
      "src": "https://github.com/HiPhish/neotest-busted"
    },
    "neotest-foundry": {
      "sha256": "sha256-bHKJCVtth/F36kjq+l9hHRRPMNITc+46kmFczVAixIg=",
      "src": "https://github.com/llllvvuu/neotest-foundry"
    },
    "neotest-haskell": {
      "sha256": "sha256-DZ1c/qGJO84DC+GeQoFv6JPIoXEGBsfa45NhqjeknUU=",
      "src": "https://github.com/mrcjkb/neotest-haskell"
    },
    "neotest-zig": {
      "sha256": "sha256-nW1jkx3kZU5qOqAByaGH45Scku/TYtT1I5UoZ36/WC4=",
      "src": "https://github.com/lawrence-laz/neotest-zig"
    },
    "netman.nvim": {
      "sha256": "sha256-SmpAuhDM764kT8BG1XWztNt3CJITohhrGoaB3DBo0U0=",
      "src": "https://github.com/miversen33/netman.nvim",
      "version": "'v1.15'"
    },
    "nfnl": {
      "sha256": "sha256-g8YfvFPvIXQoaT9g7Hsvr9W4XRuLoGMi5psp4awfQhQ=",
      "src": "https://github.com/Olical/nfnl"
    },
    "nix-update.nvim": {
      "sha256": "sha256-li3febSwIFL6JZPUFdm3pmRFu2TUv7h3NmyjvrJR5QE=",
      "src": "https://github.com/reo101/nix-update.nvim"
    },
    "noir-nvim": {
      "sha256": "sha256-43faeguFVsNvfm1C1h2viR0xp5oY0uYGsB5zu+Zh1sU=",
      "src": "https://github.com/noir-lang/noir-nvim.git"
    },
    "nui.nvim": {
      "sha256": "sha256-41slmnvt1z7sCxvpiVuFmQ9g7eCaxQi1dDCL3AxSL1A=",
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-FeMaco.lua": {
      "sha256": "sha256-eDPdCU1ZBoSiMkdreExsW3AzynQjSfFFCbZQ7f+XGFM=",
      "src": "https://github.com/AckslD/nvim-FeMaco.lua"
    },
    "nvim-bqf": {
      "sha256": "sha256-/mpnDjlOiWbezhPFmbDMnJNk7AwrAh1JY1oik3HhcM0=",
      "src": "https://github.com/kevinhwang91/nvim-bqf"
    },
    "nvim-cmp-rust": {
      "sha256": "sha256-BwU8Y5CuDw7pEbtAHzaQL8yKe3Q0mvhHQQjc1n0S9H4=",
      "src": "https://github.com/ryo33/nvim-cmp-rust"
    },
    "nvim-colorizer.lua": {
      "sha256": "sha256-gQnWyUVE4iXvliUSy8Cig1Ov4iMCP1UmCFIskZ6nijQ=",
      "src": "https://github.com/NvChad/nvim-colorizer.lua"
    },
    "nvim-dap": {
      "sha256": "sha256-U9RMvCDeNQjZ/8TFn848YQXhccIvZsBf7Axa/IipX/Q=",
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-ui": {
      "sha256": "sha256-391zChjd6uAJycfXy1RG2Qt0OdCY3/WF9u0MWLtFZxA=",
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "sha256": "sha256-8hsk+EwnvoHCNhb0dcL9e4hQg9I+t/5Cy9ZoZgcz4fU=",
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text"
    },
    "nvim-hs.vim": {
      "sha256": "sha256-umsuGGP5tOf92bzWEhqD2y6dN0FDBsmLx60f45xgmig=",
      "src": "https://github.com/neovimhaskell/nvim-hs.vim"
    },
    "nvim-java-core": {
      "sha256": "sha256-cM1+Z89x2IP9CJ5Ow1kQTsp66Ay6JfVE2LcjpAbls/w=",
      "src": "https://github.com/nvim-java/nvim-java-core"
    },
    "nvim-java-dap": {
      "sha256": "sha256-Xrzydrlbo8B99Y1kJUri0H/3gLBHXaZ/jbIZIfhi2gU=",
      "src": "https://github.com/nvim-java/nvim-java-dap"
    },
    "nvim-java-test": {
      "sha256": "sha256-aqFg+m8EMNpQkj5aQPZaW18dtez+AsxARiEiU3ycW6I=",
      "src": "https://github.com/nvim-java/nvim-java-test"
    },
    "nvim-keymap-amend": {
      "sha256": "sha256-fjhZLetXo+chDywxukJtuMv15gJgi4c3lwYx+ubOUr4=",
      "src": "https://github.com/anuvyklack/nvim-keymap-amend"
    },
    "nvim-lspconfig": {
      "sha256": "sha256-vyKacUFSZ0zJBkVqttDybvatxV9fKRUMPZLpak52//k=",
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-luaref": {
      "sha256": "sha256-nmsKg1Ah67fhGzevTFMlncwLX9gN0JkR7Woi0T5On34=",
      "src": "https://github.com/milisims/nvim-luaref"
    },
    "nvim-metals": {
      "sha256": "sha256-LhVcJ5KbQeUik1+ZEuY/zoLKXkLAYb+sn6EcJFMfLjw=",
      "src": "https://github.com/scalameta/nvim-metals"
    },
    "nvim-navic": {
      "sha256": "sha256-rRUlGtClq4NmyDqg0NhytnxFDMVpQhuF5cPKKRJHl88=",
      "src": "https://github.com/SmiteshP/nvim-navic"
    },
    "nvim-nio": {
      "sha256": "sha256-eDbzJAGdUBhTwuD0Nt9FihZj1MmVdQfn/GKIybuu5a8=",
      "src": "https://github.com/nvim-neotest/nvim-nio",
      "version": "'v1.8.0'"
    },
    "nvim-notify": {
      "sha256": "sha256-h7STMjY+CBTqBkIDJXgtJz4WhNeQ02ES2Jesi3jZXeM=",
      "src": "https://github.com/rcarriga/nvim-notify"
    },
    "nvim-paredit": {
      "sha256": "sha256-nRaS6ViO+fqg6cZiyNZhCrIpFC6Lnn5Rv2WjQTmR2uA=",
      "src": "https://github.com/julienvincent/nvim-paredit",
      "version": "'v1.1.1'"
    },
    "nvim-surround": {
      "sha256": "sha256-3rvRrTVYImIuOPk7DsbP3m2w4M7WS1mjKE2EOKibGf4=",
      "src": "https://github.com/kylechui/nvim-surround",
      "version": "'4.0.0'"
    },
    "nvim-treesitter": {
      "sha256": "sha256-CVs9FTdg3oKtRjz2YqwkMr0W5qYLGfVyxyhE3qnGYbI=",
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-ts-context-commentstring": {
      "sha256": "sha256-AjDM3+n4+lNBQi8P2Yrh0Ab06uYCndBQT9TX36rDbOM=",
      "src": "https://github.com/JoosepAlviste/nvim-ts-context-commentstring"
    },
    "nvim-ts-hint-textobject": {
      "sha256": "sha256-QB9fyhhZAsZztp2wQpxCLQaDJmjpumEMIG7NZoO2aS0=",
      "src": "https://github.com/mfussenegger/nvim-ts-hint-textobject"
    },
    "nvim-web-devicons": {
      "sha256": "sha256-KgodVxZaBcGN8D/2+R/8kXD7VWXJtz1+pMSTvlCJ7dM=",
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "octo.nvim": {
      "sha256": "sha256-CoMxiA3CWM+iwCjcs7wBkBU71vWGrm0CqNfkt9gyIKM=",
      "src": "https://github.com/pwntester/octo.nvim"
    },
    "oil.nvim": {
      "sha256": "sha256-hoTQoNEsCbZ0aZMUUUvgkC9NYjovjUUirw2FN9b9dn0=",
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "omnisharp-extended-lsp.nvim": {
      "sha256": "sha256-0cRngH9BFuBbEu7007Xqr5zVJSBUowni7jxaMxGwnzU=",
      "src": "https://github.com/Hoffs/omnisharp-extended-lsp.nvim"
    },
    "parinfer-rust": {
      "sha256": "sha256-WhxebTxGffFyNC6EFNO2dSNkBNiKM47VDjbvit2B9h4=",
      "src": "https://github.com/eraserhd/parinfer-rust"
    },
    "plantuml-syntax": {
      "sha256": "sha256-qmo5xI7Vugtsbl95RW2Pnu6cDei1Xz7Pq06HrrwPpI4=",
      "src": "https://github.com/aklt/plantuml-syntax"
    },
    "plenary.nvim": {
      "sha256": "sha256-9Un7ekhBxcnmFE1xjCCFTZ7eqIbmXvQexpnhduAg4M0=",
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "popup.nvim": {
      "sha256": "sha256-dNWz/xovUg55fDZUpVs/2kLphk3lqQyvPtc9ATwbeSQ=",
      "src": "https://github.com/nvim-lua/popup.nvim"
    },
    "promise-async": {
      "sha256": "sha256-9eM66brPjiFlY64vmBetRYrKnpDyN7+/URMm4GsGimA=",
      "src": "https://github.com/kevinhwang91/promise-async"
    },
    "quicker.nvim": {
      "sha256": "sha256-cL/BxgmqWE28UVRwoGXz0pSlJREjrQw5/st15SITYeA=",
      "src": "https://github.com/stevearc/quicker.nvim",
      "version": "'v1.4.0'"
    },
    "rainbow-delimiters.nvim": {
      "sha256": "sha256-DHzdssZkkegR3pk3X0jwGJy5G/BZ/TAGPoNCqo9OnOc=",
      "src": "https://github.com/HiPhish/rainbow-delimiters.nvim"
    },
    "rustaceanvim": {
      "sha256": "sha256-7UTu+AKuGqPqZzM1WJ9s4qQklE27LEilaHO9vpCgC1o=",
      "src": "https://github.com/mrcjkb/rustaceanvim",
      "version": "'v7.0.8'"
    },
    "rustowl": {
      "sha256": "sha256-/szpOp9b1DqZuGGotgq5Il3TkMFybcT4G61E7pA8rR8=",
      "src": "https://github.com/cordx56/rustowl"
    },
    "schemastore.nvim": {
      "sha256": "sha256-4OvxfTkjLI2eCoBIIhYHrEfCEqkJKxbdRT+PO1HEwJw=",
      "src": "https://github.com/b0o/schemastore.nvim"
    },
    "sidekick.nvim": {
      "sha256": "sha256-ABuILCcKfYViZoFHaCepgIMLjvMEb/SBmGqGHUBucAM=",
      "src": "https://github.com/folke/sidekick.nvim"
    },
    "snacks.nvim": {
      "sha256": "sha256-vRedYg29QGPGW0hOX9qbRSIImh1d/SoDZHImDF2oqKM=",
      "src": "https://github.com/folke/snacks.nvim",
      "version": "'v2.30.0'"
    },
    "sort.nvim": {
      "sha256": "sha256-h6m2Zh2u5r9EMRo4CbGCXqC1bG4bUfuCYWZo4T3MEtQ=",
      "src": "https://github.com/sQVe/sort.nvim"
    },
    "stay-in-place.nvim": {
      "sha256": "sha256-Cq9/JQoxuUiAQPobiSizwmvdxJRjE7XjG47A38wdVwY=",
      "src": "https://github.com/gbprod/stay-in-place.nvim"
    },
    "strudel.nvim": {
      "sha256": "sha256-LhS41aKsYJpKqoF2S3ZzeDLYGBKA4iMN2o34k8YOWHs=",
      "src": "https://github.com/gruvw/strudel.nvim"
    },
    "tabout.nvim": {
      "sha256": "sha256-5T/nefCPCR2K1vySTG0vzh5+6weHinBLahPBL37+VtY=",
      "src": "https://github.com/abecodes/tabout.nvim"
    },
    "telescope-file-browser.nvim": {
      "sha256": "sha256-FlJ7w5Ywwq03E0oYdnFJFb+MMUMQMa+5QhDMy2O9tGQ=",
      "src": "https://github.com/nvim-telescope/telescope-file-browser.nvim"
    },
    "telescope-github.nvim": {
      "sha256": "sha256-Neojvrrjq6S+s1ZKW389N3SK4NvInkrIUVcDX8Mj7I8=",
      "src": "https://github.com/nvim-telescope/telescope-github.nvim"
    },
    "telescope-media-files.nvim": {
      "sha256": "sha256-+mIQVIoreE+goSBtMucgiEPldI01JDRdCKWH/6mzey8=",
      "src": "https://github.com/nvim-telescope/telescope-media-files.nvim"
    },
    "telescope-packer.nvim": {
      "sha256": "sha256-iBu2JSITuNO3qY8xpP3SOWyb9IrkOQfQKfN4IBRmIp0=",
      "src": "https://github.com/nvim-telescope/telescope-packer.nvim"
    },
    "telescope-symbols.nvim": {
      "sha256": "sha256-zYON9z3ELwjfqZ11LD6E7M+bymuBHxrSjYXhsCPEwR8=",
      "src": "https://github.com/nvim-telescope/telescope-symbols.nvim"
    },
    "telescope.nvim": {
      "sha256": "sha256-Z5wmLGMd+GODObFOYU7CrucwDnBpT5rJjfE5vHwjRxE=",
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "telescope_hoogle": {
      "sha256": "sha256-Z7GSENbICkM0q1ojZXOxFEQiytiCrXCiUE/18b20b1Q=",
      "src": "https://github.com/luc-tielen/telescope_hoogle"
    },
    "texmagic.nvim": {
      "sha256": "sha256-6KY+AIQB9OpSDO5MA6+deir++OT9rCj2SpUaZej+zeg=",
      "src": "https://github.com/jakewvincent/texmagic.nvim"
    },
    "tiny-inline-diagnostic.nvim": {
      "sha256": "sha256-cIG8PPcYjJxsTbaeEN/P/D75wou1c1A2+2XkxN1aUPw=",
      "src": "https://github.com/rachartier/tiny-inline-diagnostic.nvim"
    },
    "todo-comments.nvim": {
      "sha256": "sha256-VGeIRfwQsHgSO89Pmn6yIP9na1F6mmYZx0HDLe9IKCQ=",
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "toggleterm.nvim": {
      "sha256": "sha256-fytbX+L12TK45YKFU9K+iFJcDrwboKabihc2LtX29J4=",
      "src": "https://github.com/akinsho/toggleterm.nvim",
      "version": "'v2.12.0'"
    },
    "tokyonight.nvim": {
      "sha256": "sha256-4zfkv3egdWJ/GCWUehV0MAIXxsrGT82Wd1Qqj1SCGOk=",
      "src": "https://github.com/folke/tokyonight.nvim"
    },
    "tree-sitter-comment": {
      "sha256": "sha256-JVZkRj7fv/T234ZAk/pM6UYC91mTJoeIgDFkZ9p3m0o=",
      "src": "https://github.com/OXY2DEV/tree-sitter-comment"
    },
    "tree-sitter-hy": {
      "sha256": "sha256-AtB/tEPmJraVTGxdkFMC3pO1+MwPyutnFkjIMyL7KSw=",
      "src": "https://github.com/kwshi/tree-sitter-hy"
    },
    "tree-sitter-jj_template": {
      "sha256": "sha256-Z4z5u4i6xyLdn+hfmrKlWHISBUnRqcRHkMN+O/QEIK8=",
      "src": "https://github.com/reo101/tree-sitter-jj_template"
    },
    "tree-sitter-nu": {
      "sha256": "sha256-0ebKHKexu1TROwfxokwwpPhCO+Nn7HmmX40jRu19xNo=",
      "src": "https://github.com/nushell/tree-sitter-nu"
    },
    "tree-sitter-uci": {
      "sha256": "sha256-SxMwFChWxus/SdWXT7NPwPNqPPB60p6pYGNRyq0t/Y4=",
      "src": "https://github.com/reo101/tree-sitter-uci"
    },
    "treesj": {
      "sha256": "sha256-XMpH1OzhqLfRhieabuFys28nO8PhdHE1vBkTOU+jiBk=",
      "src": "https://github.com/reo101/treesj",
      "version": "'feat/nix-attrset-shorthand'"
    },
    "trouble.nvim": {
      "sha256": "sha256-6U/KWjvRMxWIxcsI2xNU/ltfgkaFG4E3BdzC7brK/DI=",
      "src": "https://github.com/folke/trouble.nvim",
      "version": "'v3.1.0'"
    },
    "true-zen.nvim": {
      "sha256": "sha256-euaxTWS98i14wvuKrFvdCRigsKqrSUwZpMEmYtUBBss=",
      "src": "https://github.com/pocco81/true-zen.nvim"
    },
    "typed-fennel": {
      "sha256": "sha256-oHvvnjmVQRy7JoaqIEJag8pYDk//NB2XrTc/wMhKnYU=",
      "src": "https://github.com/reo101/typed-fennel"
    },
    "typst-preview.nvim": {
      "sha256": "sha256-2IGGLRLVf1Or6nu3y07HQZ2fvcOzWOUNZ4B6eMUeugc=",
      "src": "https://github.com/chomosuke/typst-preview.nvim",
      "version": "'v1.3.4'"
    },
    "typst.nvim": {
      "sha256": "sha256-tgNsqvyu2nHudv9xdtZXXVUoqB0SgGt4b5hr18ZmwKk=",
      "src": "https://github.com/SeniorMars/typst.nvim"
    },
    "ultimate-autopair.nvim": {
      "sha256": "sha256-gK3yUt/Fwf/DnkGGRJ2YFDGxWgsQ7weat157oMQePaA=",
      "src": "https://github.com/altermo/ultimate-autopair.nvim",
      "version": "'v0.6'"
    },
    "videre.nvim": {
      "sha256": "sha256-CMV372A/X9+ObbqNrUu8tMX++rhvP85mNKOuIZEvvRo=",
      "src": "https://github.com/Owen-Dechow/videre.nvim"
    },
    "vim-easy-align": {
      "sha256": "sha256-9CfWi83DCzWBARNG6AA0MQllEfQ/3UtYtYPDWLdmDwk=",
      "src": "https://github.com/junegunn/vim-easy-align"
    },
    "vim-gas": {
      "sha256": "sha256-9Rfn7n/cn5XQ3Ykbe4aQbGKToewQbydXuzJT8IISGNM=",
      "src": "https://github.com/shirk/vim-gas"
    },
    "vim-jjdescription": {
      "sha256": "sha256-IIiBJlGmdYntwqizUy2xB8hhBJBGa1ASK9hmN8xZEvk=",
      "src": "https://github.com/avm99963/vim-jjdescription"
    },
    "vim-numbertoggle": {
      "sha256": "sha256-TFByXuBhw9/OcNhe+aqY8+QN2sFvhCkWxhMgBwSV3LQ=",
      "src": "https://github.com/jeffkreeftmeijer/vim-numbertoggle"
    },
    "vim-octave": {
      "sha256": "sha256-HfcmlQPMwef4fnBMV4rgt/tASlfTXJr82uG1fcNSINw=",
      "src": "https://github.com/McSinyx/vim-octave"
    },
    "vim-repeat": {
      "sha256": "sha256-G/dmkq1KtSHIl+I5p3LfO6mGPS3eyLRbEEsuLbTpGlk=",
      "src": "https://github.com/tpope/vim-repeat"
    },
    "vim-textobj-user": {
      "sha256": "sha256-4+9SlywaEKpJL6MM2jcBjFoy2dpLqviil9idVNkeL/g=",
      "src": "https://github.com/kana/vim-textobj-user"
    },
    "which-key.nvim": {
      "sha256": "sha256-rKaYnXM4gRkkF/+xIFm2oCZwtAU6CeTdRWU93N+Jmbc=",
      "src": "https://github.com/folke/which-key.nvim",
      "version": "'v3.13.2'"
    },
    "winshift.nvim": {
      "sha256": "sha256-mW3kaducHWRlDx18WcwcbWDlNnAyHgELS3XjpeFFCgs=",
      "src": "https://github.com/sindrets/winshift.nvim"
    }
  }
}